ZeroZap/wch/CH595EVT/EXAM/SRC/StdPeriphDriver/inc/CH595SFR.h
/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((PUINT32V)0x40001048)) // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((PUINT8V)0x4000104B))  // RWA, PLL configuration control, SAM
#define  RB_PLL_CFG_DAT     0x3F                      // RWA, PLL configuration control, SAM

/* System: 32MHz oscillator control register */
#define R8_XT32M_TUNE       (*((PUINT8V)0x4000104E))  // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF

/* System: oscillator frequency calibration register */
#define R32_OSC_CALIB       (*((PUINT32V)0x40001050)) // RWA, oscillator frequency calibration, SAM
#define R16_OSC_CAL_CNT     (*((PUINT16V)0x40001050)) // RO, system clock count value for 32KHz multi-cycles
#define  RB_OSC_CAL_CNT     0x3FFF                    // RO, system clock count value for 32KHz multi-cycles
#define  RB_OSC_CAL_OV_CLR  0x4000                    // RW1, indicate R8_OSC_CAL_OV_CNT not zero, set 1 to clear R8_OSC_CAL_OV_CNT
#define  RB_OSC_CAL_IF      0x8000                    // RW1, interrupt flag for oscillator capture end, set 1 to clear
#define R8_OSC_CAL_OV_CNT   (*((PUINT8V)0x40001052))  // RO, oscillator frequency calibration overflow times
#define R8_OSC_CAL_CTRL     (*((PUINT8V)0x40001053))  // RWA, oscillator frequency calibration control, SAM
#define  RB_OSC_CNT_TOTAL   0x07                      // RWA, total cycles mode for oscillator capture
// RB_OSC_CNT_TOTAL: select total cycles for oscillator capture
//    000: 1
//    001: 2
//    010: 4
//    011: 32
//    100: 64
//    101: 128
//    110: 1024
//    111: 2047
#define  RB_OSC_CNT_HALT    0x08                      // RO, calibration counter halt status: 0=counting, 1=halt for reading count value
#define  RB_OSC_CAL_IE      0x10                      // RWA, interrupt enable for oscillator capture end
#define  RB_OSC_CNT_EN      0x20                      // RWA, calibration counter enable
#define  RB_OSC_CNT_END     0x40                      // RWA, select oscillator capture end mode: 0=normal, 1=append 2 cycles

/* System: ADC and Touch-key register */
#define R32_ADC_CTRL        (*((PUINT32V)0x40001058)) // RW, ADC control
#define R8_ADC_CHANNEL      (*((PUINT8V)0x40001058))  // RW, ADC input channel selection
#define  RB_ADC_CH_INX      0x0F                      // RW, ADC input channel index
#define R8_ADC_CFG          (*((PUINT8V)0x40001059))  // RW, ADC configure
#define  RB_ADC_POWER_ON    0x01                      // RW, ADC power control: 0=power down, 1=power on
#define  RB_ADC_BUF_EN      0x02                      // RW, ADC input buffer enable 
#define  RB_ADC_DIFF_EN     0x04                      // RW, ADC input channel mode: 0=single-end, 1=differnetial
#define  RB_ADC_OFS_TEST    0x08                      // RW, enable ADC offset test mode: 0=normal mode, 1=short to test offset
#define  RB_ADC_PGA_GAIN    0x30                      // RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB
#define  RB_ADC_CLK_DIV     0x40                      // RW, select ADC clock frequency: 0=16MHz, 1=32MHz
#define R8_ADC_CONVERT      (*((PUINT8V)0x4000105A))  // RW, ADC convert control
#define  RB_ADC_START       0x01                      // RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear
#define  RB_ADC_CHAN_EN     0x08                      // RW, enable ADC channel
#define  RB_ADC_SAMPLE_TIME 0x30                      // RW, ADC sampling cycle: 00=4, 01=6, 10=8, 11=10
#define  RB_ADC_EOC_X       0x80                      // RO, end of ADC conversion flag
#define R8_TEM_SENSOR       (*((PUINT8V)0x4000105B))  // RW, temperature sensor control
#define  RB_TEM_SEN_PWR_ON  0x80                      // RW, temperature sensor power control: 0=power down, 1=power on
#define R32_ADC_DATA        (*((PUINT32V)0x4000105C)) // RO, ADC data and status
#define R16_ADC_DATA        (*((PUINT16V)0x4000105C)) // RO, ADC data
#define  RB_ADC_DATA        0x0FFF                    // RO, ADC conversion data
#define R8_ADC_INT_FLAG     (*((PUINT8V)0x4000105E))  // RO, ADC interrupt flag register
#define  RB_ADC_IF_EOC      0x80                      // RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, auto ADC or write R8_ADC_CONVERT or write RB_TKEY_CTRANS_ACT to clear flag


#define R8_TKEY_CFG        (*((PUINT8V)0x40001057))   // RW, Touchkey configure
#define  RB_TKEY_DRV_EN     0x04                      // RW, Touchkey drive shield enable
#define  RB_ADC_PGA_CFG    	0x08                      // RW, ADC input PGA speed selection: 0=normal, 1=fast
#define  RB_TKEY_DMA_EN     0x40                      // RW, Touchkey DMA enable
#define R32_TKEY_CFG2      (*((PUINT32V)0x40001078))  // RW, Touchkey control2
#define  RB_TKEY_TRANS      0x07                      // RW, Touchkey charge transfer time(Tsys): 000=1, 001=4, 010=8, 011=12, 100=16, 101=24, 110=32, 111=48
#define  RB_TKEY_CC         0x18                      // RW, Touchkey capacitor charging time(Tsys): 00=1, 01=2, 10=3, 11=4 
#define  RB_TKADC_START_SEL 0x60                      // RW, number of transfer cycle to start ADC in advance: 00=2, 01=4, 10=8, 11=16
#define  RB_TKEY_EN         0x80                      // RW, enable Touchkey
#define  RB_TKEY_CTRANS_ACT 0x100                     // RW, Touchkey start signal and status, auto clear
#define  RB_TRANSFER_N      0x3FF0000                 // RW, number of transfer cycle
#define R32_TKEY_SEL        (*((PUINT32V)0x4000107C)) // RW, Touchkey select
#define  RB_SEL_S           0x3FFF                    // RW, selection of charge transfer channels
#define  RB_DRIVEROUT_EN    0x3FFF0000                // RW, Touchkey drive shielding channel selection switch

#define R32_ADC_DMA_CTRL    (*((PUINT32V)0x40001060)) // RW, ADC DMA control
#define R8_ADC_CTRL_DMA     (*((PUINT8V)0x40001061))  // RW, ADC DMA control
#define  RB_ADC_DMA_ENABLE  0x01                      // RW, ADC DMA enable
#define  RB_ADC_DMA_LOOP    0x04                      // RW, ADC DMA address loop enable
#define  RB_ADC_IE_DMA_END  0x08                      // RW, enable interrupt for ADC DMA completion
#define  RB_ADC_IE_EOC      0x10                      // RW, enable interrupt for end of ADC conversion
#define  RB_ADC_CONT_EN     0x40                      // RW, enable contineous conversion ADC
#define  RB_ADC_AUTO_EN     0x80                      // RW, enable auto continuing ADC for DMA
#define R8_ADC_DMA_IF       (*((PUINT8V)0x40001062))  // RW1, ADC interrupt flag
#define  RB_ADC_IF_DMA_END  0x08                      // RW1, interrupt flag for ADC DMA completion
#define  RB_ADC_IF_END_ADC  0x10                      // RW1, interrupt flag for end of ADC conversion, DMA for auto ADC or write R8_ADC_CONVERT to clear flag
#define R8_ADC_AUTO_CYCLE   (*((PUINT8V)0x40001063))  // RW, auto ADC cycle value, unit is 16 Fsys
#define R32_ADC_DMA_NOW     (*((PUINT32V)0x40001064)) // RW, ADC DMA current address
#define R16_ADC_DMA_NOW     (*((PUINT16V)0x40001064)) // RW, ADC DMA current address
#define R32_ADC_DMA_BEG     (*((PUINT32V)0x40001068)) // RW, ADC DMA begin address
#define R16_ADC_DMA_BEG     (*((PUINT16V)0x40001068)) // RW, ADC DMA begin address
#define R32_ADC_DMA_END     (*((PUINT32V)0x4000106C)) // RW, ADC DMA end address
#define R16_ADC_DMA_END     (*((PUINT16V)0x4000106C)) // RW, ADC DMA end address
#define R32_ADC_SCAN_CFG1   (*((PUINT32V)0x40001070)) // RW, ADC scan config 1
#define  RB_ADC_SCAN_CH1    0x0000000F                // RW, ADC Channel 1 analog input channel selection bit
#define  RB_ADC_SCAN_CH2    0x000000F0                // RW, ADC Channel 2 analog input channel selection bit
#define  RB_ADC_SCAN_CH3    0x00000F00                // RW, ADC Channel 3 analog input channel selection bit
#define  RB_ADC_SCAN_CH4    0x0000F000                // RW, ADC Channel 4 analog input channel selection bit
#define  RB_ADC_SCAN_CH5    0x000F0000                // RW, ADC Channel 5 analog input channel selection bit
#define  RB_ADC_SCAN_CH6    0x00F00000                // RW, ADC Channel 6 analog input channel selection bit
#define  RB_ADC_SCAN_CH7    0x0F000000                // RW, ADC Channel 7 analog input channel selection bit
#define  RB_ADC_SCAN_CH8    0xF0000000                // RW, ADC Channel 8 analog input channel selection bit
#define R32_ADC_SCAN_CFG2   (*((PUINT32V)0x40001074)) // RW, ADC scan config 2
#define  RB_ADC_SCAN_CH9    0x0000000F                // RW, ADC Channel 9 analog input channel selection bit
#define  RB_ADC_SCAN_CH10   0x000000F0                // RW, ADC Channel 10 analog input channel selection bit
#define  RB_ADC_SCAN_CH11   0x00000F00                // RW, ADC Channel 11 analog input channel selection bit
#define  RB_ADC_SCAN_CH12   0x0000F000                // RW, ADC Channel 12 analog input channel selection bit
#define  RB_ADC_SCAN_CH13   0x000F0000                // RW, ADC Channel 13 analog input channel selection bit
#define  RB_EHCH_TIM        0x00300000                // RW, times of ADC scanning channels
#define  RB_ADC_SCAN_EN     0x00800000                // RW, enable channel scan mode
#define  RB_ADC_SCAN_NUM    0x0F000000                // RW, Number of ADC scanning channels
#define  RB_ADC_SCAN_SEL    0x10000000                // RW, ADC scan function selection: 0=TKEY, 1=ADC
#define  RB_ADC_IE_SCAN_END 0x20000000                // RW, ADC scan end interrupt enable: 0=disable, 1=enable
#define  RB_ADC_SCAN_MASKDIS 0x40000000               // RW, enable to close channel after sampling:0=enable to close, 1=disable to close
#define  RB_ADC_IF_SCAN_END 0x80000000                // RW, ADC scan end flag, write 1 to clear

/* System: Flash ROM control register */
#define R32_FLASH_CTRL      (*((PUINT32V)0x40001800)) // RWA, flash ROM control
#define R8_PREPG_CTRL      	(*((PUINT8V)0x40001800))  // RWA, flash ROM preprogram control
#define  RB_PREG_AUTO_EN  	0x01				      // RWA, flash ROM preprogram automode enable
#define  RB_PREG_MODE  		0x06				      // RWA, flash ROM preprogram mode
#define  RB_PREG_START  	0x10				      // RWA, flash ROM preprogram start
#define R8_BUF_CTRL      	(*((PUINT8V)0x40001801))  // RWA, flash ROM buf control
#define  RB_BUF_CLR_START  	0x01				      // RWA, flash ROM buf clear
#define  RB_BUF_LOAD_START 	0x10				      // RWA, flash ROM buf load
#define  RB_BUF_LOAD_AUTO 	0x20				      // RWA, flash ROM buf load automode
#define R8_ERASE_CTRL      	(*((PUINT8V)0x40001802))  // RWA, flash ROM erase control
#define  RB_ERASE_MODE  	0x03				      // RWA, flash ROM erase mode
#define  RB_ERASE_START  	0x10				      // RWA, flash ROM erase start
#define R8_PROGRAM_CTRL    	(*((PUINT8V)0x40001803))  // RWA, flash ROM program control
#define  RB_PROGRAM_START  	0x01				      // RWA, flash ROM program start
#define R32_FLASH_CTRL2     (*((PUINT32V)0x40001804)) // RWA, flash ROM control2
#define R8_READ_CTRL     	(*((PUINT8V)0x40001807))  // RWA, flash ROM read control
#define  RB_CFG_RD_EN  		0x01				      // RWA, flash ROM read enable
#define  RB_RD_START  		0x02				      // RWA, flash ROM read start
#define  RB_WRRD_ADDR_INC 	0x04				      // RWA, flash ROM address increase after read
#define  RB_FLASH_CLK 		0x30				      // RWA, flash ROM clock setting
#define R32_FLASH_CTRL3     (*((PUINT32V)0x40001808)) // RWA, flash ROM control3
#define R8_RDPRCTDIS_CTRL 	(*((PUINT8V)0x40001808))  // RWA, flash ROM rdprotect control
#define  RB_RD_PROTECTDIS_FLAG 0x01				      // RO, flash ROM rdprotect disable flag
#define  RB_RDPROTECT_DISSTATE 0x0e				      // RO, flash ROM rdprotect disable state
#define  RB_RD_PROTECTDIS_START 0xc0				  // RO, flash ROM rdprotect disable start flag
#define R8_CHIP_STATUS 		(*((PUINT8V)0x40001809))  // RO, flash ROM status
#define  RB_RD_PROTECT 		0x01				      // RO, flash ROM rdprotect
#define  RB_DBG_MODE 		0x02				      // RO, flash ROM debug mode
#define  RB_FLASH_HALTED 	0x08				      // RO, flash ROM halted 
#define R32_FLASH_ADDR      (*((PUINT32V)0x4000180C)) // RWA, flash ROM addr
#define R32_FLASH_DATA      (*((PUINT32V)0x40001810)) // RWA, flash ROM data
#define R8_FLASH_DATA       (*((PUINT8V)0x40001810))  // RWA, flash ROM data
#define R32_FLASH_DATA1     (*((PUINT32V)0x40001814)) // RO, flash ROM data1
#define R8_FLASH_DATA1      (*((PUINT8V)0x40001814))  // RO, flash ROM data1
#define R32_FLASH_DATA2     (*((PUINT32V)0x40001818)) // RO, flash ROM data2
#define R8_FLASH_DATA2      (*((PUINT8V)0x40001818))  // RO, flash ROM data2
#define R32_FLASH_DATA3     (*((PUINT32V)0x4000181C)) // RO, flash ROM data4
#define R8_FLASH_DATA3      (*((PUINT8V)0x4000181C))  // RO, flash ROM data4
#define R32_FLASH_STATUS    (*((PUINT32V)0x40001820)) // RO, flash ROM status

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_EN     (*((PUINT32V)0x40001090)) // RW, GPIO interrupt enable
#define R16_PA_INT_EN       (*((PUINT16V)0x40001090)) // RW, GPIO PA interrupt enable
#define R16_PB_INT_EN       (*((PUINT16V)0x40001092)) // RW, GPIO PB interrupt enable
#define R32_GPIO_INT_MODE   (*((PUINT32V)0x40001094)) // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_MODE     (*((PUINT16V)0x40001094)) // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R16_PB_INT_MODE     (*((PUINT16V)0x40001096)) // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R32_GPIO_INT_EDGE_TYPE (*((PUINT32V)0x40001098)) // RW, GPIO interrupt edge selection
#define R16_PA_INT_EDGE_TYPE (*((PUINT16V)0x40001098)) // RW, GPIO PA interrupt edge selection
#define R16_PB_INT_EDGE_TYPE (*((PUINT16V)0x4000109A)) // RW, GPIO PB interrupt edge selection
#define R32_GPIO_INT_IF     (*((PUINT32V)0x4000109C)) // RW1, GPIO interrupt flag
#define R16_PA_INT_IF       (*((PUINT16V)0x4000109C)) // RW1, GPIO PA interrupt flag
#define R16_PB_INT_IF       (*((PUINT16V)0x4000109E)) // RW1, GPIO PB interrupt flag

/* GPIO PA register */
#define R32_PA_DIR          (*((PUINT32V)0x400010A0)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0         (*((PUINT8V)0x400010A0))  // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1         (*((PUINT8V)0x400010A1))  // RW, GPIO PA I/O direction byte 1
#define R32_PA_PIN          (*((PUINT32V)0x400010A4)) // RO, GPIO PA input
#define R8_PA_PIN_0         (*((PUINT8V)0x400010A4))  // RO, GPIO PA input byte 0
#define R8_PA_PIN_1         (*((PUINT8V)0x400010A5))  // RO, GPIO PA input byte 1
#define R32_PA_OUT          (*((PUINT32V)0x400010A8)) // RW, GPIO PA output
#define R8_PA_OUT_0         (*((PUINT8V)0x400010A8))  // RW, GPIO PA output byte 0
#define R8_PA_OUT_1         (*((PUINT8V)0x400010A9))  // RW, GPIO PA output byte 1
#define R32_PA_CLR          (*((PUINT32V)0x400010AC)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0         (*((PUINT8V)0x400010AC))  // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1         (*((PUINT8V)0x400010AD))  // WZ, GPIO PA clear output byte 1
#define R32_PA_PU           (*((PUINT32V)0x400010B0)) // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0          (*((PUINT8V)0x400010B0))  // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1          (*((PUINT8V)0x400010B1))  // RW, GPIO PA pullup resistance enable byte 1
#define R32_PA_PD_DRV       (*((PUINT32V)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output
#define R8_PA_PD_DRV_0      (*((PUINT8V)0x400010B4))  // RW, PA pulldown for input or PA driving capability for output byte 0
#define R8_PA_PD_DRV_1      (*((PUINT8V)0x400010B5))  // RW, PA pulldown for input or PA driving capability for output byte 1
#define R32_PA_SET          (*((PUINT32V)0x400010B8)) // WZ, PA output setting, 0=keep output, 1=output high level
#define R8_PA_SET_0         (*((PUINT8V)0x400010B8))  // WZ, PA output setting byte 0
#define R8_PA_SET_1         (*((PUINT8V)0x400010B9))  // WZ, PA output setting byte 1

/* GPIO PB register */
#define R32_PB_DIR          (*((PUINT32V)0x400010C0)) // RW, GPIO PB I/O direction: 0=in, 1=out
#define R8_PB_DIR_0         (*((PUINT8V)0x400010C0))  // RW, GPIO PB I/O direction byte 0
#define R8_PB_DIR_1         (*((PUINT8V)0x400010C1))  // RW, GPIO PB I/O direction byte 1
#define R8_PB_DIR_2         (*((PUINT8V)0x400010C2))  // RW, GPIO PB I/O direction byte 2
#define R32_PB_PIN          (*((PUINT32V)0x400010C4)) // RO, GPIO PB input
#define R8_PB_PIN_0         (*((PUINT8V)0x400010C4))  // RO, GPIO PB input byte 0
#define R8_PB_PIN_1         (*((PUINT8V)0x400010C5))  // RO, GPIO PB input byte 1
#define R8_PB_PIN_2         (*((PUINT8V)0x400010C6))  // RO, GPIO PB input byte 2
#define R32_PB_OUT          (*((PUINT32V)0x400010C8)) // RW, GPIO PB output
#define R8_PB_OUT_0         (*((PUINT8V)0x400010C8))  // RW, GPIO PB output byte 0
#define R8_PB_OUT_1         (*((PUINT8V)0x400010C9))  // RW, GPIO PB output byte 1
#define R8_PB_OUT_2         (*((PUINT8V)0x400010CA))  // RW, GPIO PB output byte 2
#define R32_PB_CLR          (*((PUINT32V)0x400010CC)) // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R8_PB_CLR_0         (*((PUINT8V)0x400010CC))  // WZ, GPIO PB clear output byte 0
#define R8_PB_CLR_1         (*((PUINT8V)0x400010CD))  // WZ, GPIO PB clear output byte 1
#define R8_PB_CLR_2         (*((PUINT8V)0x400010CE))  // WZ, GPIO PB clear output byte 2
#define R32_PB_PU           (*((PUINT32V)0x400010D0)) // RW, GPIO PB pullup resistance enable
#define R8_PB_PU_0          (*((PUINT8V)0x400010D0))  // RW, GPIO PB pullup resistance enable byte 0
#define R8_PB_PU_1          (*((PUINT8V)0x400010D1))  // RW, GPIO PB pullup resistance enable byte 1
#define R8_PB_PU_2          (*((PUINT8V)0x400010D2))  // RW, GPIO PB pullup resistance enable byte 2
#define R32_PB_PD_DRV       (*((PUINT32V)0x400010D4)) // RW, PB pulldown for input or PB driving capability for output
#define R8_PB_PD_DRV_0      (*((PUINT8V)0x400010D4))  // RW, PB pulldown for input or PB driving capability for output byte 0
#define R8_PB_PD_DRV_1      (*((PUINT8V)0x400010D5))  // RW, PB pulldown for input or PB driving capability for output byte 1
#define R8_PB_PD_DRV_2      (*((PUINT8V)0x400010D6))  // RW, PB pulldown for input or PB driving capability for output byte 2
#define R32_PB_SET          (*((PUINT32V)0x400010D8)) // WZ, PB output setting, 0=keep output, 1=output high level
#define R8_PB_SET_0         (*((PUINT8V)0x400010D8))  // WZ, PB output setting byte 0
#define R8_PB_SET_1         (*((PUINT8V)0x400010D9))  // WZ, PB output setting byte 1
#define R8_PB_SET_2         (*((PUINT8V)0x400010DA))  // WZ, PB output setting byte 2

/* GPIO register address offset and bit define */
#define BA_PA               ((PUINT8V)0x400010A0)     // point GPIO PA base address
#define BA_PB               ((PUINT8V)0x400010C0)     // point GPIO PB base address
#define GPIO_DIR            0x00
#define GPIO_DIR_0          0x00
#define GPIO_DIR_1          0x01
#define GPIO_DIR_2          0x02
#define GPIO_PIN            0x04
#define GPIO_PIN_0          0x04
#define GPIO_PIN_1          0x05
#define GPIO_PIN_2          0x06
#define GPIO_OUT            0x08
#define GPIO_OUT_0          0x08
#define GPIO_OUT_1          0x09
#define GPIO_OUT_2          0x0A
#define GPIO_CLR            0x0C
#define GPIO_CLR_0          0x0C
#define GPIO_CLR_1          0x0D
#define GPIO_CLR_2          0x0E
#define GPIO_PU             0x10
#define GPIO_PU_0           0x10
#define GPIO_PU_1           0x11
#define GPIO_PU_2           0x12
#define GPIO_PD_DRV         0x14
#define GPIO_PD_DRV_0       0x14
#define GPIO_PD_DRV_1       0x15
#define GPIO_PD_DRV_2       0x16
#define GPIO_SET            0x18
#define GPIO_SET_0          0x18
#define GPIO_SET_1          0x19
#define GPIO_SET_2          0x1A

