ZeroZap/wch/CH595EVT/EXAM/SRC/StdPeriphDriver/inc/CH595SFR.h
/* GPIO alias name */
#define  bAIN0              (1<<4)                    // PA4
#define  bRXD3              (1<<4)                    // PA4
#define  bRXD3_             (1<<4)                    // PA4
#define  bKEYSCAN0          (1<<4)                    // PA4
#define  bTKEY_A4           (1<<4)                    // PA4
#define  bAIN1              (1<<5)                    // PA5
#define  bTXD3              (1<<5)                    // PA5
#define  bTXD3_             (1<<5)                    // PA5
#define  bKEYSCAN1          (1<<5)                    // PA5
#define  bTKEY_A5           (1<<5)                    // PA5
#define  bAIN10             (1<<6)                    // PA6
#define  bRXD2_             (1<<6)                    // PA6
#define  bPWM4_             (1<<6)                    // PA6
#define  bRI                (1<<6)                    // PA6
#define  bKEYSCAN2          (1<<6)                    // PA6
#define  bTKEY_A6           (1<<6)                    // PA6
#define  bAIN11             (1<<7)                    // PA7
#define  bTXD2_             (1<<7)                    // PA7
#define  bPWM5_             (1<<7)                    // PA7
#define  bDCD               (1<<7)                    // PA7
#define  bKEYSCAN3          (1<<7)                    // PA7
#define  bTKEY_A7           (1<<7)                    // PA7
#define  bAIN12             (1<<8)                    // PA8
#define  bRXD1              (1<<8)                    // PA8
#define  bKEYSCAN4          (1<<8)                    // PA8
#define  bTKEY_A8           (1<<8)                    // PA8
#define  bAIN13             (1<<9)                    // PA9
#define  bTMR0              (1<<9)                    // PA9
#define  bCAP0              bTMR0
#define  bPWM0              bTMR0
#define  bTXD1              (1<<9)                    // PA9
#define  bTKEY_A9           (1<<9)                    // PA9
#define  bX32KI             (1<<10)                   // PA10
#define  bTMR1              (1<<10)                   // PA10
#define  bCAP1              bTMR1
#define  bPWM1              bTMR1
#define  bTKEY_A10          (1<<10)                   // PA10
#define  bENCCAP_IN1_       (1<<10)                   // PA10
#define  bAIN6              (1<<10)                   // PA10
#define  bX32KO             (1<<11)                   // PA11
#define  bTMR2              (1<<11)                   // PA11
#define  bCAP2              bTMR2
#define  bPWM2              bTMR2
#define  bTKEY_A11          (1<<11)                   // PA11
#define  bLED3              (1<<11)                   // PA11
#define  bENCCAP_IN2_       (1<<11)                   // PA11
#define  bAIN7              (1<<11)                   // PA11
#define  bSWDIO             (1<<12)                   // PA12
#define  bAIN2              (1<<12)                   // PA12
#define  bPWM4              (1<<12)                   // PA12
#define  bSCS               (1<<12)                   // PA12
#define  bTKEY_A12          (1<<12)                   // PA12
#define  bLED2              (1<<12)                   // PA12
#define  bAIN3              (1<<13)                   // PA13
#define  bSCK0              (1<<13)                   // PA13
#define  bPWM5              (1<<13)                   // PA13
#define  bSWCLK             (1<<13)                   // PA13
#define  bTKEY_A13          (1<<13)                   // PA13
#define  bLED1              (1<<13)                   // PA13
#define  bAIN4              (1<<14)                   // PA14
#define  bMOSI              (1<<14)                   // PA14
#define  bTXD0_             (1<<14)                   // PA14
#define  bTKEY_A14          (1<<14)                   // PA14
#define  bLED0              (1<<14)                   // PA14
#define  bAIN5              (1<<15)                   // PA15
#define  bMISO              (1<<15)                   // PA15
#define  bRXD0_             (1<<15)                   // PA15
#define  bTKEY_A15          (1<<15)                   // PA15
#define  bLED_CLK           (1<<15)                   // PA15

#define  bPWM6              (1<<0)                    // PB0
#define  bCTS               (1<<0)                    // PB0
#define  bAIN8              (1<<0)                    // PB0
#define  bTKEY_B0           (1<<0)                    // PB0
#define  bPWM7              (1<<4)                    // PB4
#define  bRXD0              (1<<4)                    // PB4
#define  bRTS               (1<<6)                    // PB6
#define  bPWM8              (1<<6)                    // PB6
#define  bAIN9              (1<<6)                    // PB6
#define  bTKEY_B6           (1<<6)                    // PB6
#define  bTXD0              (1<<7)                    // PB7
#define  bPWM9              (1<<7)                    // PB7
#define  bUDM               (1<<10)                   // PB10
#define  bTMR1_             (1<<10)                   // PB10
#define  bCAP1_             bTMR1_
#define  bPWM1_             bTMR1_
#define  bENCCAP_IN1        (1<<10)                   // PB10
#define  bUDP               (1<<11)                   // PB11
#define  bTMR2_             (1<<11)                   // PB11
#define  bCAP2_             bTMR2_
#define  bPWM2_             bTMR2_
#define  bENCCAP_IN2        (1<<11)                   // PB11
#define  bLED3_             (1<<11)                   // PB11
// #define  bU2DM              (1<<12)                   // PB12
#define  bSCS_              (1<<12)                   // PB12
#define  bRXD1_             (1<<12)                   // PB12
#define  bLED2_             (1<<12)                   // PB12
#define  bRI_               (1<<12)                   // PB12
// #define  bU2DP              (1<<13)                   // PB13
#define  bSCK0_             (1<<13)                   // PB13
#define  bTXD1_             (1<<13)                   // PB13
#define  bLED1_             (1<<13)                   // PB13
#define  bDCD_              (1<<13)                   // PB13
#define  bDSR               (1<<14)                   // PB14
#define  bMOSI_             (1<<14)                   // PB14
#define  bSDA               (1<<14)                   // PB14
#define  bPWM10             (1<<14)                   // PB14
#define  bLED0_             (1<<14)                   // PB14
#define  bMISO_             (1<<15)                   // PB15
#define  bSCL               (1<<15)                   // PB15
#define  bDTR               (1<<15)                   // PB15
#define  bLED_CLK_          (1<<15)                   // PB15
#define  bRXD2              (1<<22)                   // PB22
#define  bTMR3              (1<<22)                   // PB22
#define  bCAP3              bTMR3
#define  bPWM3              bTMR3
#define  bTMR3_             (1<<22)                   // PB22
#define  bCAP3_             bTMR3_
#define  bPWM3_             bTMR3_
#define  bRST               (1<<23)                   // PB23
#define  bTMR0_             (1<<23)                   // PB23
#define  bCAP0_             bTMR0_
#define  bPWM0_             bTMR0_
#define  bTXD2              (1<<23)                   // PB23
#define  bPWM11             (1<<23)                   // PB23

/* Timer0 register */
#define R32_TMR0_CONTROL    (*((PUINT32V)0x40002000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((PUINT8V)0x40002000))  // RW, TMR0 mode control
#define R8_TMR0_INTER_EN    (*((PUINT8V)0x40002002))  // RW, TMR0 interrupt enable
// #define R32_TMR0_STATUS     (*((PUINT32V)0x40002004)) // RW, TMR0 status
#define R8_TMR0_INT_FLAG    (*((PUINT8V)0x40002006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((PUINT8V)0x40002007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((PUINT32V)0x40002008)) // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((PUINT16V)0x40002008)) // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((PUINT8V)0x40002008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((PUINT32V)0x4000200C)) // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO       (*((PUINT32V)0x40002010)) // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO       (*((PUINT16V)0x40002010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((PUINT8V)0x40002010))  // RO/WO, TMR0 FIFO register

