ZeroZap/wch/CH595EVT/EXAM/SRC/StdPeriphDriver/inc/CH595SFR.h
/* LCD register */
#define R32_LCD_CMD         (*((PUINT32V)(0x40006000)))
#define R8_LCD_CMD          (*((PUINT8V)(0x40006000)))
#define  RB_LCD_SYS_EN      0x01                      // RW, LCD digital system enable
#define  RB_LCD_ON          0x02                      // RW, LCD analog system enable
#define  RB_LCD_BIAS        0x04                      // RW, LCD bias select:  0=1/2 bias,  1=1/3 bias
#define  RB_LCD_DUTY        0x18                      // RW, LCD duty select:  00=1/2 duty,  01=1/3 duty,  10=1/4 duty
#define  RB_LCD_SCAN_CLK    0x60                      // RW, LCD scan clock select: 00=256Hz, 01=512Hz, 10=1KHz, 11=128Hz
#define  RB_LCD_VLCD_SEL    0x80                      // RW, LCD drive voltage��0=VIO33*100%(3.3V),1=VIO33*76%(2.5V)
#define  RB_LCD_SEG0_7_EN   0xFF00                    // RW, SEG0-SEG7 enable
#define  RB_LCD_SEG8_15_EN  0xFF0000                  // RW, SEG8-SEG15 enable
#define  RB_LCD_SEG16_19_EN 0xF000000                 // RW, SEG16-SEG19 enable

#define R32_LCD_RAM0        (*((PUINT32V)(0x40006004))) // RW, LCD driver data0, address 0-3
#define R32_LCD_RAM1        (*((PUINT32V)(0x40006008))) // RW, LCD driver data1, address 4-7
#define R32_LCD_RAM2        (*((PUINT32V)(0x4000600C))) // RW, LCD driver data2, address 8-12

/* KEYSCAN register */
#define R16_KEY_SCAN_CTRL   (*((PUINT16V)0x40006040))// KEY SCAN control register
#define  RB_SCAN_START_EN   0x0001                   // RW, start key scan enable,1=enable 0=disable
#define  RB_SCAN_CNT_END    0x000E                   // RW, set the times of the same key_scan value 
#define  RB_SCAN_CLK_DIV    0x00F0                   // RW, divider value of scanning clock
#define  RB_PIN_SCAN_EN     0x1F00                   // RW, select which pin could be scaned, 1=enable 0=disable
#define  RB_SCAN_1END_WAKE_EN 0x2000                 // RW, wake up chip after 1 round of key scanning, 1=enable 0=disable 
#define  RB_CLR_WAKEUP_EN   0x4000                   // RW, claer wake_up siginal after chip wakeing up, 1=enable 0=disable 
#define R8_KEY_SCAN_INT_EN  (*((PUINT8V)0x40006042)) // KEY SCAN interupt enable register
#define  RB_KEY_PRESSED_IE  0x01                     // RW, detect key pressed interupt enable   
#define  RB_SCAN_1END_IE    0x02                     // RW, key scan 1 round end interupt enable
#define  RB_KEY_RELEASED_IE 0x04                     // RW, detect key released interupt enable 
#define R8_KEY_SCAN_INT_FLAG (*((PUINT8V)0x40006043))// KEY SCAN interupt flag register 
#define  RB_KEY_PRESSED_IF  0x01                     // RW1, detect key pressed flag enable  
#define  RB_SCAN_1END_IF    0x02                     // RW1, key scan 1 round end flag enable       
#define  RB_KEY_RELEASED_IF 0x04                     // RW1, detect key released flag enable            
#define R32_KEY_SCAN_NUMB   (*((PUINT32V)0x40006044))// SCAN_KEY number address now register
#define  RB_KEY_SCAN_NUMB   0x0FFFFF                 // SCAN_KEY number address now 
#define  RB_KEY_SCAN_CNT    0x700000                 // current SCAN_KEY times

/* ENCODER register */
#define R32_ENC_REG_CTRL    (*((PUINT32V)0x40006080))
#define R8_ENC_REG_CTRL     (*((PUINT8V)0x40006080))  // RW, ENCODER control register
// #define  RB_WAKEUP_CLR_EN   0x10                      // RW, clear wake_up siginal after chip wake up enable   
#define  RB_START_ENC_EN    0x01                      // RW, start encode enable   
#define  RB_SMS_MODE        0x06                      // RW, SMS mode value,10=T1EDGE,01=T2EDGE,11=T12EDGE
#define  RB_RD_CLR_EN       0x08                      // RW, clear encoder count value after R32_ENC_REG_CCNT be read
#define  RB_ENC_DIR         0x20                      // RO, encoder director,0=forward,1=backward  
#define  RB_ENC_IN_CH1      0x40                      // RO, encoder capture channel 1 value
#define  RB_ENC_IN_CH2      0x80                      // RO, encoder capture channel 2 value
#define R8_ENC_INTER_EN     (*((PUINT8V)0x40006081))  // RW, ENCODER interupt enable register
#define  RB_IE_DIR_INC      0x01                      // RW, encode increase interupt enable 
#define  RB_IE_DIR_DEC      0x02                      // RW, encode decrease interupt enable
#define R8_ENC_INT_FLAG     (*((PUINT8V)0x40006082))  // RW, ENCODER interupt flag register
#define  RB_IF_DIR_INC      0x01                      // RWA, encode increase interupt flag 
#define  RB_IF_DIR_DEC      0x02                      // RWA, encode decrease interupt flag
#define R32_ENC_REG_CEND    (*((PUINT32V)0x40006084))
#define R32_ENC_REG_CCNT    (*((PUINT32V)0x40006088))

/* LED register */
#define R32_LED_CONTROL     (*((PUINT32V)0x4000E000)) // RW, LED control
#define R8_LED_CTRL_MOD     (*((PUINT8V)0x4000E000))  // RW, LED mode control
#define R8_LED_CLOCK_DIV    (*((PUINT8V)0x4000E001))  // RW, LED serial clock divisor
#define R8_LED_STATUS       (*((PUINT8V)0x4000E004))  // RO, LED status
#define R32_LED_FIFO        (*((PUINT32V)0x4000E008)) // WO, LED FIFO register, width is half-word, only low 16 bit
#define R16_LED_FIFO        (*((PUINT16V)0x4000E008)) // WO, LED FIFO register, width is half-word
#define R32_LED_DMA_CNT     (*((PUINT32V)0x4000E010)) // RW, LED DMA main buffer remainder half-word count, exclude auxiliary buffer, automatic decreasing after DMA, only low 12 bit
#define R16_LED_DMA_CNT     (*((PUINT16V)0x4000E010)) // RW, LED DMA main buffer remainder half-word count, exclude auxiliary buffer, automatic decreasing after DMA, only low 12 bit
#define R32_LED_DMA_MAIN    (*((PUINT32V)0x4000E014)) // RW, LED main buffer DMA begin & current address, automatic increasing after DMA
#define R16_LED_DMA_MAIN    (*((PUINT16V)0x4000E014)) // RW, LED main buffer DMA begin & current address, automatic increasing after DMA
#define R32_LED_DMA_AUX     (*((PUINT32V)0x4000E018)) // RW, LED auxiliary buffer DMA begin & current address, automatic increasing after DMA
#define R16_LED_DMA_AUX     (*((PUINT16V)0x4000E018)) // RW, LED auxiliary buffer DMA begin & current address, automatic increasing after DMA

/* LED register address offset and bit define */
#define LED_FIFO_SIZE       2                         // LED FIFO size (depth), width is half-word
#define BA_LED              ((PUINT8V)0x4000E000)     // point LED base address
#define LED_CTRL_MOD        0
#define  RB_LED_BIT_ORDER   0x01                      // RW, LED bit data order: 0=LSB first, 1=MSB first
#define  RB_LED_ALL_CLEAR   0x02                      // RW, force clear LED FIFO and count
#define  RB_LED_OUT_POLAR   0x04                      // RW, LED output polarity: 0=pass, 1=invert
#define  RB_LED_OUT_EN      0x08                      // RW, LED output enable
#define  RB_LED_DMA_EN      0x10                      // RW, LED DMA enable and DMA interrupt enable
#define  RB_LED_IE_FIFO     0x20                      // RW, enable interrupt for LED FIFO <=2
#define  RB_LED_CHAN_MOD    0xC0                      // RW, LED channel mode: 00=LED0, 01=LED0/1, 10=LED0~3, 11=LED0~3 and LED2/3 from auxiliary buffer
// RB_LED_CHAN_MOD: LED channel mode
//   00: single channel output, LED0
//   01: dual channels output, LED0/1
//   10: 4 channels output, LED0~3
//   11: 4 channels output and LED2/3 from aux buffer, LED0~3
#define LED_CLOCK_DIV       1
#define LED_STATUS          4
#define  RB_LED_FIFO_COUNT  0x07                      // RO, LED FIFO byte count status, must divided by 2 for width half-word
#define  RB_LED_CLOCK       0x10                      // RO, current LED clock level
#define  RB_LED_IF_FIFO     0x20                      // RW1, interrupt flag for LED FIFO <=2, cleared by RW1 or write R32/R16_LED_FIFO
#define  RB_LED_FIFO_EMPTY  0x40                      // RO: indicate FIFO empty status
#define  RB_LED_IF_DMA_END  0x80                      // RW1, interrupt flag for LED DMA completion, cleared by RW1 or write R32/R16_LED_DMA_CNT
#define LED_FIFO            8
#define LED_DMA_CNT         0x10
#define LED_DMA_BEG         0x14
#define LED_DMA_END         0x18


/* Address space define */
#define BA_CODE             ((PUINT32)0x00000000)     // point code base address
#define SZ_CODE             0x00040000                // code size
#define BA_SFR              ((PUINT32)0x40000000)     // point SFR base address
#define SZ_SFR              0x00010000                // SFR size
#define BA_RAM              ((PUINT32)0x20000000)     // point RAM base address
#define SZ_RAM              0x00008000                // RAM size

